In [51]:
%load_ext sql
%sql mysql://root:password@localhost/pizza_project

The sql extension is already loaded. To reload it, use:
  %reload_ext sql

In [52]:
%%sql
RENAME TABLE `Order` TO `orders`;

 * mysql://root:***@localhost/pizza_project
(MySQLdb.OperationalError) (1050, "Table 'orders' already exists")
[SQL: RENAME TABLE `Order` TO `orders`;]
(Background on this error at: https://sqlalche.me/e/20/e3q8)

In [53]:
%%sql

SHOW TABLES;

 * mysql://root:***@localhost/pizza_project
17 rows affected.

[('customer',),
 ('customerdiscount',),
 ('customers',),
 ('delivery',),
 ('delivery_persons',),
 ('deliveryperson',),
 ('dessert',),
 ('discountcode',),
 ('drink',),
 ('earningsreport',),
 ('ingredient',),
 ('order',),
 ('order_items',),
 ('orderitem',),
 ('orders',),
 ('pizza',),
 ('pizzaingredient',)]

In [54]:
%%sql
SELECT * FROM Pizza;

 * mysql://root:***@localhost/pizza_project
10 rows affected.

[(1, 'Margherita', 'Tomato, cheese, basil', Decimal('4.00'), 1, 0),
 (2, 'Pepperoni', 'Tomato, cheese, pepperoni', Decimal('5.00'), 0, 0),
 (3, 'Vegetarian', 'Tomato, cheese, mushrooms, olives, pineapple, tomato, onion, garlic, basil, oregano', Decimal('8.75'), 1, 0),
 (4, 'Hawaiian', 'Tomato, cheese, ham, pineapple', Decimal('4.75'), 0, 0),
 (5, 'Meat Feast', 'Tomato, cheese, pepperoni, ham, chicken, beef', Decimal('7.00'), 0, 0),
 (6, 'Vegan', 'Tomato, vegan cheese, mushrooms, olives, pineapple, tomato, onion, garlic, basil, oregano', Decimal('8.75'), 1, 0),
 (7, 'Spicy', 'Tomato, cheese, pepperoni, chilli flakes, pepper', Decimal('5.00'), 0, 0),
 (8, 'Cheese Feast', 'Tomato, cheese, vegan cheese', Decimal('4.00'), 1, 0),
 (9, 'Dessert', 'Nutella, banana, strawberry', Decimal('4.25'), 1, 0),
 (10, 'Fruity', 'Tomato, cheese, pineapple, banana, strawberry', Decimal('5.25'), 1, 0)]

In [55]:
%%sql
SELECT * FROM Dessert;
DESC Dessert;

 * mysql://root:***@localhost/pizza_project
5 rows affected.
3 rows affected.

[('DessertID', 'int', 'NO', 'PRI', None, 'auto_increment'),
 ('Name', 'varchar(255)', 'YES', '', None, ''),
 ('Price', 'decimal(10,2)', 'YES', '', None, '')]

In [56]:
%%sql
SELECT * FROM Ingredient LIMIT 5;

 * mysql://root:***@localhost/pizza_project
5 rows affected.

[(1, 'Base', Decimal('2.00'), 1, 1),
 (2, 'Cheese', Decimal('0.50'), 1, 0),
 (3, 'Sauce', Decimal('0.50'), 1, 1),
 (4, 'Pepperoni', Decimal('1.00'), 0, 0),
 (5, 'Mushrooms', Decimal('0.75'), 1, 1)]

In [57]:
%%sql

SELECT * FROM orderItem;

 * mysql://root:***@localhost/pizza_project
0 rows affected.

[]

In [58]:
%%sql

SELECT * FROM orders;

 * mysql://root:***@localhost/pizza_project
1 rows affected.

[(1, 1, datetime.datetime(2024, 9, 30, 15, 39, 17), 'Pending', None, Decimal('31.48'), 0, None)]